namespace Task_49
{
    internal class Program
    {
        public static void Main(string[] args)
        {
            /*Задача 49: Задайте двумерный массив. Найдите элементы, у которых оба индекса
                         чётные, и замените эти элементы на их квадраты
             
                         Например, изначально массив            Новый массив будет выглядеть
                         выглядел вот так:                      вот так:
                         1 4 7 2                                1 4 49 2
                         5 9 2 3                                5 9 2 3
                         8 4 2 4                                64 4 4 4 */
            
        }
    }
}