namespace Task_58
{
    internal class Program
    {
        public static void Main(string[] args)
        {
            /*Задача 58: Задайте две матрицы. Напишите программу, которая будет находить
                         произведение двух матриц.
                         
                         Например, даны 2 матрицы:
                         А В
                         1 4 | 3 5
                         3 5 | 1 2

                         Результирующая матрица будет:
                         С
                         7 13
                         14 25*/
            
        }
    }
}